<template><div><h1 id="三、css三大特性" tabindex="-1"><a class="header-anchor" href="#三、css三大特性"><span>三、CSS三大特性</span></a></h1>
<ol>
<li>
<p>层叠性
概念：如果发生了样式冲突，那就会根据一定的规则（选择器优先级），进行样式的层叠（覆 盖）。
什么是样式冲突？ ——— 元素的同一个样式名，被设置了不同的值，这就是冲突。</p>
</li>
<li>
<p>继承性
概念：元素会自动拥有其父元素、或其祖先元素上所设置的某些样式。
规则：优先继承离得近的。
常见的可继承属性： text-?? ， font-?? ， line-?? 、 color ......
备注：参照MDN网站，可查询属性是否可被继承。</p>
</li>
<li>
<p>优先级
简单聊： !important &gt; 行内样式 &gt; ID选择器 &gt; 类选择器 &gt; 元素选择器 &gt; * &gt; 继承的样 式。
详细聊：需要计算权重。
计算权重时需要注意：并集选择器的每一个部分是分开算的！</p>
</li>
</ol>
</div></template>


